import { getBotId } from '#root/bot/helpers/botId.js'

export function getRefText() {
  switch (getBotId()) {
    case '8348068067':
      return `<b>PRO ПАССИВНЫЙ ДОХОД</b>

💸 В этом видео я подробно рассказываю, как <b>с абсолютного нуля</b> можно выйти на доход от <b>100 000₽ уже в первый месяц</b>, используя только телефон.

Без опыта в крипте. Без денег на первый депозит. Без каких-то особых навыков на старте.

Через партнёрскую программу <b>ATTIC</b> я показываю, как можно заработать свои первые <b>1000–2000$</b>, выстроив понятную систему, а не надеясь на удачу. И самое главное - делюсь тем, как эта модель приводит к <b>легальному, ежедневному пассивному доходу</b>, а не к постоянной гонке за результатом.

😱 Сегодня мой результат - это более чем <b>20 стран</b>, пятый год живу и зимую за границей, <b>купила свою первую недвижимость</b> и уже больше пяти лет не хожу в офис и не работаю на начальника.

Но главное - я на собственном опыте поняла, что такое <b>реально работающий пассивный доход</b>, который даёт свободу выбора: где жить, как работать и какую жизнь строить дальше.

✔️<i>Если вы давно присматриваетесь к партнёрке, но не понимали, <b>как это выглядит на практике</b> - это видео точно стоит посмотреть до конца.</i>`
  }
  return ''
}
