import { getBotId } from '#root/bot/helpers/botId.js'

export function getRefText() {
  switch (getBotId()) {
    case '8527410297':
      return `В этом видео я по шагам рассказываю, как можно выйти на доход от <b>300 000 ₽ в месяц</b>, имея под рукой только телефон.📱 

📌Благодаря этому доходу я заработал свой <b>первый миллион рублей уже в 17 лет</b> и успел побывать в <b>15 странах</b>.

Без опыта, без сложных схем и даже без денег на первый депозит - всё разбираю максимально честно и понятно.

Показываю систему, которая позволяет заработать первые деньги и со временем выстроить <b>стабильный и легальный пассивный доход.</b>💸

Если давно искали адекватный и рабочий вариант - это видео точно стоит посмотреть.`
    case '8432660105':
      return `
Партнёрская программа <b>ATTIC</b> - это мой основной источник дохода, благодаря которому я побывал в <b>15 странах</b>, купил <b>родителям автомобиль, себе квартиру</b> и в целом сильно прокачал качество жизни. 💵

❗️Если вам интересен <b>пассивный доход по принципу «порекомендовал - зарабатываешь»</b>, то партнёрская программа ATTIC - именно то направление, на котором зарабатываю я сам.

В этом видео подробно рассказываю, в чём суть системы. Всё максимально просто: вы рекомендуете продукты экосистемы ATTIC - торговых роботов, сигналы и обучение криптовалюте.

📌 Дальше система делает всё сама: каждый человек автоматически закрепляется за вами, а партнёрские вознаграждения начисляются без ручного контроля.

То есть: человек купил продукт & вы сразу заработали. Он продолжает пользоваться сигналами или роботами - вы зарабатываете <b>на постоянной основе</b>.

Если интересно разобраться, как это работает изнутри - смотрите видео.`
    case '8348068067':
      return `<b>PRO ПАССИВНЫЙ ДОХОД</b>

💸 В этом видео я подробно рассказываю, как <b>с абсолютного нуля</b> можно выйти на доход от <b>100 000₽ уже в первый месяц</b>, используя только телефон.

Без опыта в крипте. Без денег на первый депозит. Без каких-то особых навыков на старте.

Через партнёрскую программу <b>ATTIC</b> я показываю, как можно заработать свои первые <b>1000–2000$</b>, выстроив понятную систему, а не надеясь на удачу. И самое главное - делюсь тем, как эта модель приводит к <b>легальному, ежедневному пассивному доходу</b>, а не к постоянной гонке за результатом.

😱 Сегодня мой результат - это более чем <b>20 стран</b>, пятый год живу и зимую за границей, <b>купила свою первую недвижимость</b> и уже больше пяти лет не хожу в офис и не работаю на начальника.

Но главное - я на собственном опыте поняла, что такое <b>реально работающий пассивный доход</b>, который даёт свободу выбора: где жить, как работать и какую жизнь строить дальше.

✔️<i>Если вы давно присматриваетесь к партнёрке, но не понимали, <b>как это выглядит на практике</b> - это видео точно стоит посмотреть до конца.</i>`
  }
  return ''
}
