import { getBotId } from '#root/bot/helpers/botId.js'

export function getRefText() {
  switch (getBotId()) {
    case '8527410297':
      return `1) В этом видео я подробно расскажу как с нуля выйти на доход от 300.000₽ используя только телефон.

Даже если у Вас нет опыта и денег на свой первый депозит.

Также узнаете как с помощью этой системы создать пассивный доход.

2) Благодаря этому доходу я заработал первый млн₽ в 17 лет и посетил 15 стран.

Живу свободной жизнью и не привязан ни к месту, ни ко времени, ни к обстоятельствам.

Работаю на себя из любой точки мира.`
    case '8432660105':
      return `Партнёрская программа ATTIC — это мой основной источник дохода который позволил мне посетить 15 стран, купить родителям автомобиль, себе квартиру и много крутого! 

Если тебе интересен пассивный доход по системе «позови друга», то партнёрская программа ATTIC — именно то направление, на котором зарабатываю я сам.

В чём суть партнёрской программы ATTIC?

Ты просто рекомендуешь продукты экосистемы ATTIC:

торговых роботов

торговые сигналы

обучение криптовалюте

📌 Система автоматически:

закрепляет каждого человека за тобой

начисляет тебе все партнёрские вознаграждения

То есть:
человек купил продукт → ты сразу заработал.
Он торгует по сигналам или через робота → ты зарабатываешь постоянно.`
    case '8348068067':
      return `<b>PRO ПАССИВНЫЙ ДОХОД</b>

💸 В этом видео я подробно рассказываю, как <b>с абсолютного нуля</b> можно выйти на доход от <b>100 000₽ уже в первый месяц</b>, используя только телефон.

Без опыта в крипте. Без денег на первый депозит. Без каких-то особых навыков на старте.

Через партнёрскую программу <b>ATTIC</b> я показываю, как можно заработать свои первые <b>1000–2000$</b>, выстроив понятную систему, а не надеясь на удачу. И самое главное - делюсь тем, как эта модель приводит к <b>легальному, ежедневному пассивному доходу</b>, а не к постоянной гонке за результатом.

😱 Сегодня мой результат - это более чем <b>20 стран</b>, пятый год живу и зимую за границей, <b>купила свою первую недвижимость</b> и уже больше пяти лет не хожу в офис и не работаю на начальника.

Но главное - я на собственном опыте поняла, что такое <b>реально работающий пассивный доход</b>, который даёт свободу выбора: где жить, как работать и какую жизнь строить дальше.

✔️<i>Если вы давно присматриваетесь к партнёрке, но не понимали, <b>как это выглядит на практике</b> - это видео точно стоит посмотреть до конца.</i>`
  }
  return ''
}
